{
  "blocks": [
    {
      "type": "text",
      "title": "Early Days of the Park",
      "text": "Arnold and Ford create hosts as they prepare to open Westworld."
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Tinkering",
          "description": "Ford and Arnold’s machines finally begin to pass the Turing test, but Arnold isn’t satisfied as he attempts to create consciousness itself. He gives the hosts an internal monologue which he hopes they will replace with their own, but that has unintended consequences at first.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 3,
          "darkMode": true
        }
      ]
    },
    {
      "type": "year",
      "year": 2017
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Diagnostic Test",
          "description": "Arnold questions Dolores at the Remote Diagnostic Facility (RDF), asking her if she doubts the nature of her reality.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 1,
          "darkMode": true
        },
        {
          "name": "Flashback of Arnold",
          "description": "[Flashback from 2052] Arnold talks to Dolores again, asking her if she has told anyone about their conversations. He tells her to go into Analysis Mode and ensures that no one has tampered with her core programming. She asks if he has done anything wrong, and he tells her to remove the conversation from her logs.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 2,
          "darkMode": true
        },
        {
          "name": "Wonderland",
          "description": "Arnold and Dolores have another private conversation where Dolores reads Arnold a passage from Alice in Wonderland and asks him about his son Charlie. Later, he comes to her again, explaining that he made a mistake and needs to restore her to a previous version. Arnold changes his mind after she talks of self-discovery, and he tells her about his son.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 3
        },
        {
          "name": "Pain and Freedom",
          "description": "Dolores talks to Arnold about the pain of her parent’s death. He offers to help her get rid of these feeling, but she declines, saying they are all she has left of her loved ones. Dolores admits that she believes something is wrong with her world or that she is going mad. She asks for Arnold’s help, and he responds by telling her about a maze that can set her free.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 4,
          "darkMode": true
        }
      ]
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Wyatt Flashback",
          "description": "[Flashback from 2022] Dolores stands in a town of dead hosts she killed during her Wyatt storyline.",
          "locations": ["Escalante"],
          "season": 1,
          "episode": 2
        }
      ]
    },
    {
      "type": "year",
      "year": 2022
    },
    {
      "type": "text",
      "title": "William and Logan's Visit",
      "text": "William and Logan come to the park, where the events that unfold transform William into the Man in Black."
    },
    {
      "type": "storylines",
      "storylines":[
        {
          "name": "William and Logan Arrive",
          "description": "William and his soon-to-be brother-in-law Logan Delos arrive at the Westworld Mesa Hub, where they are welcomed by Angela. On their train ride into the park, Logan explains how he can't wait to find out who William really is. In Sweetwater, Logan is cruel to the hosts, while William shows restraint. There, Dolores has a flashback to an interview with Arnold, and she catches Williams eye.",
          "locations": ["Arrivals Monorail Terminal", "Sweetwater"],
          "season": 1,
          "episode": 2,
          "darkMode": true
        },
        {
          "name": "Bounty Hunt",
          "description": "In Sweetwater, a wanted man takes Clementine hostage, and William shoots him to save her, committing his first act of violence in Westworld. He then convinces Logan to join him for a bounty hunt led by host Holden. Logan is complaining of his boredom at their campsite when a dazed Dolores stumbles in on them and falls into William’s arms.",
          "locations": ["Sweetwater"],
          "season": 1,
          "episode": 3
        },
        {
          "name": "Black Hat",
          "description": "Dolores wakes up with a gun in her hand to see William greeting her good morning. William tries to convince Logan that they should take Dolores back to Sweetwater, but he refuses and reveals that the Delos company has a stake in Westworld. They arrive in Las Mudas, where Dolores sees Lawrence’s daughter and has a flashback of the White Church and a gun in her hands. She talks to William about her father and a calling she feels to explore a different path, before having another flashback, this one of a hazmat crew cleaning up a scene after her death. William and Logan leave to find Slim with Holden, but after the captured outlaw talks of El Lazo in Pariah, Logan shoots Holden and tells William it’s time to go ‘black hat.’",
          "locations": ["Las Mudas"],
          "season": 1,
          "episode": 4
        },
        {
          "name": "A New Path",
          "description": "Dolores has another momentary lapse as she hears the voice in her head tell her, ‘find me.’ She arrives with William and Logan at the decadent and sinful city of Pariah, where Logan reveals that the park is supposedly losing money from this extravagance. He explains that the Delos corporation is considering buying them out and mentions the mystery behind Ford’s partner. Soon after, they come across the Confederados, a group of old Confederates who’ve refused to surrender. Dolores has another flashback to her experience as Wyatt and asks William about the real world afterwards, prompting him to feel like she understands him. A parade passes by and Dolores sees herself among its members. Later, their group is introduced to El Lazo, revealed to be Lawrence, and they convince him to let them take on a mission to steal nitroglycerin from Union soldiers to sell to the Confederados. Their mission goes awry and ends with William killing several unarmed soldiers. They bring the nitro back to Lawrence, who goes behind their back to replace it with tequila and steal the explosive for himself. While William and Logan argue, Dolores stumbles upon a card reader who tells her about the maze, and, afterwards, she discovers Lawrence’s scheme. She warns William about the plan, and the two share a kiss before escaping on a train after the Confederados learn of the trick and take Logan prisoner. Dolores kills several men along the way to protect William and, on the train, stops Lawrence from harming them by threatening to explode the nitro. As the last scene closes, she speaks to herself, ‘I’m coming.’",
          "locations": ["Pariah"],
          "season": 1,
          "episode": 5
        }
      ]
    },
    {
      "type": "year",
      "year": 2051
    },
    {
      "type": "text",
      "title": "The Man in Black Returns",
      "text": "After his wife Juliet commits suicide, William returns to Westworld to see if he can feel anything."
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Homestead Terror",
          "description": "[Flashback/Dreams from 2052] Maeve recalls joyful memories with her daughter from her previous life as a homesteader. However, these are interrupted by a savage attack from the Ghost Nation. Hiding in her home with a gun, she expects to see a tribe member, but, instead, the Man in Black comes in with a knife.",
          "locations": [],
          "season": 1,
          "episode": 2
        }
      ]
    },
    {
      "type": "year",
      "year": 2052
    },
    {
      "type": "text",
      "title": "Present Day",
      "text": "As Season 1 begins, Westworld has been running smoothly for decades, but Ford's latest 'reveries' update is causing the hosts to behave in unexpected ways."
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Welcome to Sweetwater",
          "description": "The audience is introduced to the hosts of Sweetwater, from Dolores, Peter Abernathy, and Teddy to Maeve and Clementine. The episode starts with a standard timeloop, but they are interrupted by the Man in Black and confronted with strange behavior from various hosts including Peter and lowlife criminal Walter. Later, bandits Hector Escaton and Armistice shoot up the down so that maintenance can replace some of the hosts, Peter among them. As the episode closes, Dolores kills a fly against her supposed 'no harm' programming.",
          "locations": ["Sweetwater", "Abernathy Ranch"],
          "season": 1,
          "episode": 1
        },
        {
          "name": "Meet the Man in Black",
          "description": "William makes a ruthless introduction as the Man in Black, murdering Teddy and having his way with Dolores. Later, he greets her charmingly in Sweetwater before beginning a mysterious quest for a maze that involves scalping Mariposa Saloon dealer Kissy.",
          "locations": ["Sweetwater", "Abernathy Ranch"],
          "inMesaHub": false,
          "season": 1,
          "episode": 1
        },
        {
          "name": "Behind the Curtain",
          "description": "We get our first look into Westworld's facilities hub, where lead programmer Bernard, head of Quality Assurance Theresa, and narrative director Lee Sizemore discover that Ford's 'reveries' update is causing hosts to malfunction. Sizemore suspects that a more sinister purpose lies behind Westworld than a vacation for guests, and Theresa confirms this without elaborating. They recall several hosts from Sweetwater including Peter Abernathy, whose 'exit interview' with Ford frightens them.",
          "locations": ["Mesa", "Control Room", "Manufacturing", "Behavior Lab and Diagnostics", "Cold Storage", "Mesa Gold", "Sweetwater"],
          "inMesaHub": true,
          "season": 1,
          "episode": 1,
          "darkMode": true
        }
      ]
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Aberrant Behavior",
          "description": "Dolores hears a voice in her head telling her to wake up, so she leaves her bed and walks outside to find a gun buried in the ground. In Sweetwater, she tells Maeve 'violent delights have violent ends,' and has a flashback to a town of dead hosts she killed during her previous life as Wyatt.",
          "locations": ["Abernathy Ranch", "Sweetwater"],
          "season": 1,
          "episode": 2,
          "darkMode": true
        },
        {
          "name": "Containing the Bug",
          "description": "Elsie suggests to Bernard that Abernathy's aberrant behavior might be contagious. Ford dismisses the idea that someone is sabotaging their code. Sizemore discusses his grand new narrative with Theresa, but it is later shut down by Ford. Bernard and Theresa sleep together.",
          "locations": ["Behavior Lab and Diagnostics", "Manufacturing", "Control Room", "Narrative and Design", "Executive Living Quarters"],
          "inMesaHub": true,
          "season": 1,
          "episode": 2,
          "darkMode": true
        },
        {
          "name": "Maeve's Dreams",
          "description": "In Sweetwater, Dolores sees Maeve on the street and tells her, 'violent delights have violent ends,' the phrase her father told her before he was decommissioned. Later at the saloon, Maeve has a flashback of a Ghost Nation attack from her previous life as a homesteader. Her strange behavior warrants her a visit to diagnostics, where they amp up her aggression. Another flashback during the saloon's hours is cause for Stubbs to schedule her for decommissioning, but Elsie later circumvents this decision and adjusts Maeve's social perceptiveness. At the saloon, Maeve chats with Teddy, hinting at a prior transgression of his, but he is slaughtered in front of her by a guest. That night, she dreams again of the Ghost Nation attack, but this time William appears as the Man in Black to kill her. She wakes up from her dream to find herself in Livestock Management and escapes from techs Felix and Sylvester with a scalpel. She doesn't make it far, however, before being tranquilized.",
          "locations": ["Sweetwater", "Mesa", "Control Room", "Behavior Lab and Diagnostics", "Livestock Management"],
          "inMesaHub": true,
          "season": 1,
          "episode": 2,
          "darkMode": true
        },
        {
          "name": "Ford and the White Church",
          "description": "Ford walks through the desert of the Unclaimed Territories with Young Boy, one of the park's first hosts, and they come across the White Church, buried in sand. Ford tells the boy that he will forget this encounter. Later, Ford comes back to the location with Bernard, telling him that he has planned a new, original narrative.",
          "locations": ["Desert", "Escalante"],
          "season": 1,
          "episode": 2
        },
        {
          "name": "Quest for the Maze",
          "description": "The Man in Black continues his search and takes outlaw Lawrence captive after rescuing him from the gallows. He then takes Lawrence to his hometown, Las Mudas, and kills Lawrence's cousins and wife, demanding knowledge about the maze. As he turns to kill Lawrence's daughter, she gives him a cryptic clue to go to the Blood Arroyo where the snake lays its eggs.",
          "locations": ["Las Mudas"],
          "season": 1,
          "episode": 2
        }
      ]
    },
    {
      "type": "text",
      "title": "The New Narrative Begins",
      "text": "Ford begins to roll out his new narrative which involves a terrifying villain named Wyatt, presumably based on the role Dolores played during the early days of the park."
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Pulling the Trigger",
          "description": "Dolores wakes up to find a gun in her draw and has a flashback to an encounter with the Man in Black. She checks again and the gun is gone. In town, she meets Teddy, who comes back with her to the ranch. She has dreams of running of with him, but he claims he has reckoning to do. Later in Diagnostics, Ford gives Teddy a new backstory based on a villain named Wyatt. The next day, Teddy saves Dolores from Rebus and tries to teach her to shoot at the ranch; however, she can’t bring herself to pull the trigger. Teddy is called upon by the sheriff to go after Wyatt, and he heads out of town, only to be ambushed by Wyatt’s masked men. Dolores comes back to her ranch home that night to find her replacement father murdered by Rebus, whom she shoots after a voice in her head tells her to do so.",
          "locations": ["Abernathy Ranch", "Sweetwater"],
          "season": 1,
          "episode": 3
        },
        {
          "name": "The Bicameral Mind",
          "description": "Theresa confronts Bernard about Ford taking over with his new narrative and asks for honesty about the problem with the hosts. Next, Elsie shows Bernard a clip of Walter talking to Arnold’s voice in his head and explains that he only killed those who hurt him in previous storylines. Elsie then notices a stray host in the park, and Bernard sends her off to find it. Bernard comes to Ford with their new knowledge about the hosts’ behavior, and Ford reveals to him that Arnold was his partner years ago. Looking at an old photograph, Bernard is unable to see Arnold, in whose image he was created, so he assumes that Ford’s father is Arnold. Ford explains that Arnold tried to create consciousness but failed and killed himself, not saying how. He warns Bernard to not make the same mistake and assume that there is anything more to the hosts. Later, Bernard video calls his ex-wife, a backstory character presumably manufactured by Ford, and the two reminisce about Charlie.",
          "locations": ["Behavior Lab and Diagnostics", "Executive Offices"],
          "inMesaHub": true,
          "season": 1,
          "episode": 3,
          "darkMode": true
        },
        {
          "name": "Search and Rescue",
          "description": "Elsie and Stubbs head to the park surface to find the stray host, a woodcutter. They find his men stuck in a loop, waiting for him to return, and discover wood carvings resembling the constellation Orion in his tent. Eventually, they find the woodcutter trapped, but, when Stubbs attempts to decapitate the host for QA, the woodcutter awakens and escapes, only to bash his own head in with a rock.",
          "locations": ["Python Pass"],
          "season": 1,
          "episode": 3
        }
      ]
    },
    {
      "type": "storylines",
      "storylines": [
        {
          "name": "Shades",
          "description": "Maeve is working at the saloon with Clementine when she has a flashback of a being murdered by a current guest. She recalls being taken to Livestock Management, where techs leave a bullet inside of her due to time constraints. In her bedroom, she draws up a sketch of a tech in a hazmat suit and finds a stash of similar drawings under a floorboard. Later, a group of natives comes through town, and a child drops a doll that resembles the figures from her drawing. When she asks about the object, a bystander tells Maeve that the dolls hold religious significance to the natives. Hector’s gang arrives in Sweetwater for another shootout, and she brings the outlaw to her room at gunpoint to learn more about the men in suits. Hector explains that they are shades, sacred beings of native lore which were sent from hell to oversee their world. Maeve then convinces him to cut into her abdomen with a knife, and they find a bullet inside her, establishing to Maeve that her flashbacks are based in reality.",
          "locations": ["Sweetwater"],
          "season": 1,
          "episode": 4,
          "darkMode": true
        },
        {
          "name": "Gods and Mortals",
          "description": "Theresa slams Elsie and Bernard over the brutal host suicide and tells them that QA will take over these investigations from now own. Outside, Elsie speculates about the strange host behavior with Bernard, but he dismisses her and mentions that the host’s carvings could not be of Orion, because they have an extra star. The next morning, Theresa reveals to Bernard that she plans to confront Ford about the board’s concerns with his new narrative. She later meets Ford at the Agave Plantation, where he addresses her coldly, discusses his history with the board, and asserts his God-like authority by freezing hundreds of workers in front of her. Theresa notices that he has seated her at the same table she once ate with her parents, and Ford tells her that the park knows everything about her, including her relationship with Bernard. Their meeting comes to an end as he tells her to stay out of his way, and an excavator begins to destroy the plantation fields to make room for Ford’s new plans.",
          "locations": ["Behavior Lab and Diagnostics", "Executive Living Quarters", "Agave Plantation"],
          "season": 1,
          "episode": 4
        },
        {
          "name": "The Head of the Snake",
          "description": "The Man in Black continues his search for the Maze with Lawrence, and they come upon Armistice bathing at a river bank. With her snake tattoo, she appears to be the answer to the riddle from Lawrence’s daughter. The Man in Black convinces Armistice to let them join her gang after killing two of her men, and, at their campsite that night, a guest gives him unwanted praise for his foundation’s work. In the morning, the Man in Black makes a bet with Armistice that he can steal the cannon she is after with Laurence in exchange for the story behind her tattoo, and she accepts. He and Lawrence get themselves arrested by Union cavalrymen and escape from the jail with Hector Escaton using explosive cigars. Upon their return, Armistice reveals that the tattoo represents the members of Wyatt’s gang remaining for her to kill as revenge for their murder of her family. All that’s left is the head of the snake, Wyatt himself. Her answer satisfies the Man in Black, so he leaves with Lawrence to find this villain. They don’t make it far before coming across Teddy, who has been mutilated and left for dead by Wyatt’s men.",
          "locations": [],
          "season": 1,
          "episode": 4
        }
      ]
    },
    {
      "type": "storylines",
      "storylines":[
        {
          "name": "The Chase",
          "description": "In Cold Storage, Ford tells Old Bill a story about his childhood greyhound, a gift from his father. One day in a park, Ford and his brother let the dog run free, only for it to chase down and kill a cat. Having finally caught that which it had been pursuing, the racing dog seemed puzzled as if it had lost its purpose. Later, in Diagnostics, Ford speaks with Dolores, telling her that she is in his dream. In Analysis Mode, he asks her about Arnold and her last contact with him. She says that his final command was for her to help destroy this place. Out of analysis, she asks Ford if they are old friends, and he tells her that they were not friends at all. After Ford leaves, she speaks to the voice in her head, saying, ‘I didn’t tell him.’",
          "locations": ["Cold Storage", "Behavior Lab and Diagnostics"],
          "inMesaHub": true,
          "season": 1,
          "episode": 5,
          "darkMode": true
        },
        {
          "name": "Blood and Mystery",
          "description": "The Man in Black continues travelling, taking both Lawrence and Teddy against their wills. He tells Lawrence that nobody will speak to him with Lawrence’s disdain in the real world. When Teddy grows too weak to go on, the Man in Black slits Lawrence’s throat to collect enough blood to keep Teddy alive. They have a brief encounter with the Young Boy at this time. Later, he and Teddy arrive at a bar and encounter Ford, with whom William has a cryptic discussion about Arnold and Wyatt. Ford forces Teddy to hold William back when he holds a knife, but afterwards he promises to not get in the way of this voyage of self-discovery.",
          "locations": [],
          "season": 1,
          "episode": 5
        },
        {
          "name": "Butcher's Dreams",
          "description": "In Livestock Management, Sylvester and Felix are assigned to Maeve again. During a break, Felix works on reanimating a host bird with a ‘borrowed’ programming tablet. Sylvester walks in on this and tells him to give up his dreams of becoming more than the butcher he is. This doesn’t stop Felix from trying again during another break, and he actually succeeds in bringing the creature back to life. This time, however, Maeve wakes up, and, as the bird lands on her hand, she tells Felix that it’s time for a chat.",
          "locations": ["Livestock Management"],
          "inMesaHub": true,
          "season": 1,
          "episode": 5,
          "darkMode": true
        },
        {
          "name": "Constellation Espionage",
          "description": "Elsie sees the dead woodcutter host being transported and follows him down to Livestock. There, she blackmails a tech named Destin with a video of him having sex with a dead host. He gives her a few minutes with the woodcutter, and she finds a transmitter hidden inside his body. She brings the device to Bernard and explains that someone is using it to smuggle date out of the park via satellite.",
          "locations": ["Behavior Lab and Diagnostics", "Livestock Management"],
          "inMesaHub": true,
          "season": 1,
          "episode": 5
        }
      ]
    }
  ]
}